/*
Navicat MySQL Data Transfer

Source Server         : zs
Source Server Version : 50617
Source Host           : localhost:3306
Source Database       : abe

Target Server Type    : MYSQL
Target Server Version : 60099
File Encoding         : 65001

Date: 2016-12-24 18:10:53
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Records of all_inform
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of card
-- ----------------------------
BEGIN;
INSERT INTO `card` VALUES ('', '1', '121629582332762', '121617080757562', null, '已发卡'), ('1231231232312', '1', '121629582332762', '121617080757562', '2016-12-19 19:54:47', '已发卡');
COMMIT;

-- ----------------------------
-- Records of card_log
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of ceshi
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of class_inform
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of code
-- ----------------------------
BEGIN;
INSERT INTO `code` VALUES ('121634531947973', '15817383353', '833524', '2016-12-12 16:45:24', '2016-12-12 16:55:24'), ('admin', '18307211633', '152567', '2016-12-21 20:29:51', '2016-12-21 20:39:51');
COMMIT;

-- ----------------------------
-- Records of course
-- ----------------------------
BEGIN;
INSERT INTO `course` VALUES ('131048219119868', '语文'), ('131048252282289', '数学');
COMMIT;

-- ----------------------------
-- Records of forum
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of forum_comment
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of forum_like
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of hx_group
-- ----------------------------
BEGIN;
INSERT INTO `hx_group` VALUES ('274733559288168976', '1班2016年12月', '121454061227706', '1班2016年12月。系统默认自动创建。', '2016-12-12 16:25:31', 'native');
COMMIT;

-- ----------------------------
-- Records of info_parents
-- ----------------------------
BEGIN;
INSERT INTO `info_parents` VALUES ('121631303308559', '黄福华', '男', '1998-02-13', '15817383353', '福田'), ('212030046888631', null, null, null, '18307211633', null);
COMMIT;

-- ----------------------------
-- Records of info_student
-- ----------------------------
BEGIN;
INSERT INTO `info_student` VALUES ('121629582332762', '2016010001', '小美', '女', '2015-01-01', '1', '0', '2016-09-01', '2016-09-01', '正常就读', '121625317338152', null), ('151049180533419', '2016010002', '小天', '男', null, '0', '0', null, null, '已退学', '121625317338152', null);
COMMIT;

-- ----------------------------
-- Records of info_teacher
-- ----------------------------
BEGIN;
INSERT INTO `info_teacher` VALUES ('121617080757562', '2016020001', '李淑芳', '女', '1996-06-12', '18681543873', '授课老师', '2016-12-12', null, '入职', '龙坑', '');
COMMIT;

-- ----------------------------
-- Records of licence
-- ----------------------------
BEGIN;
INSERT INTO `licence` VALUES ('121454061227706', 'Anv3xUwcl0YDy+dtfGxlvg==', '127.0.0.1', '2016-12-12 16:21:32', '2016-12-12 17:21:32'), ('121634531947973', 'roTI3mPcywd9T5Cs4Xpkog==', '127.0.0.1', '2016-12-12 16:42:27', '2016-12-12 17:45:54'), ('131006370239645', 'CPJ26Ja1ms+ZZyYCIXZAqg==', '127.0.0.1', '2016-12-13 10:14:24', '2016-12-13 11:14:39'), ('271634032221266', '17559', '192.168.1.115', '2016-12-21 14:49:37', '2016-12-21 15:49:37');
COMMIT;

-- ----------------------------
-- Records of news
-- ----------------------------
BEGIN;
INSERT INTO `news` VALUES ('201538456445059', '好好好', '<p>啊实打实大大啊实打实大声道的萨达是的撒的打算的11111111111111</p>', null, null, '请输入...', '生活', '2016-12-20 00:00:00', '2016-12-20 17:03:34', '0', '1', '1'), ('201703570213957', '的点点滴滴', '<p>啊实打实大声道的</p>', null, null, '阿萨德', '生活', '2016-12-20 00:00:00', '2016-12-20 17:04:11', '0', '1', '1');
COMMIT;

-- ----------------------------
-- Records of person_inform
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of place_area
-- ----------------------------
BEGIN;
INSERT INTO `place_area` VALUES ('1', '龙华新区', '1');
COMMIT;

-- ----------------------------
-- Records of place_city
-- ----------------------------
BEGIN;
INSERT INTO `place_city` VALUES ('1', '深圳', '1');
COMMIT;

-- ----------------------------
-- Records of place_province
-- ----------------------------
BEGIN;
INSERT INTO `place_province` VALUES ('1', '广东'), ('2', '湖北');
COMMIT;

-- ----------------------------
-- Records of power_permission
-- ----------------------------
BEGIN;
INSERT INTO `power_permission` VALUES ('1', '用户添加'), ('2', '用户删除'), ('3', '用户修改'), ('4', '用户查询');
COMMIT;

-- ----------------------------
-- Records of power_role
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of power_role_permission
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of recipe
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of return
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of school
-- ----------------------------
BEGIN;
INSERT INTO `school` VALUES ('121450439752915', '深圳市第二幼儿园', '深圳市福田区通心岭同心路9号', '1');
COMMIT;

-- ----------------------------
-- Records of school_class
-- ----------------------------
BEGIN;
INSERT INTO `school_class` VALUES ('121625317338152', '1班', '121451107531942', '121617080757562', '2016-12-12 16:25:31', '有效');
COMMIT;

-- ----------------------------
-- Records of school_grade
-- ----------------------------
BEGIN;
INSERT INTO `school_grade` VALUES ('121451107531942', '1年级', '121450439752915'), ('121451250157260', '2年级', '121450439752915');
COMMIT;

-- ----------------------------
-- Records of school_section
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of score
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Records of student_parent_rel
-- ----------------------------
BEGIN;
INSERT INTO `student_parent_rel` VALUES ('121717088049855', '121629582332762', '121631303308559', '父女');
COMMIT;

-- ----------------------------
-- Records of timetables
-- ----------------------------
BEGIN;
INSERT INTO `timetables` VALUES ('131049001449070', '131048219119868', '121625317338152', '121617080757562', '10:30:00', '11:00:00', '1', '1');
COMMIT;

-- ----------------------------
-- Records of users
-- ----------------------------
BEGIN;
INSERT INTO `users` VALUES ('1', 'yd-7111', null, '123456', '1', null, null, null, null), ('121454061227706', 'lsf', '李老师', '123', '2', '2016-12-12 14:54:06', null, null, '121617080757562'), ('121634531947973', 'hxs', '黄先生', '123', '1', '2016-12-12 16:34:53', null, null, '121631303308559'), ('131006370239645', 'sljr', '山岭巨人', '123', '1', '2016-12-13 10:06:36', 'http://zhangshun-zs1994.oicp.net:15202/ABE_WEB/photo/131006370239645/13101439834.png', null, ''), ('212030047403656', '00123', '提阿尼头', '123', '1', '2016-12-21 20:30:04', null, null, '212030046888631'), ('271634032221266', 'qwe', '张顺1', '123', '1', '2016-10-26 23:08:14', 'http://zhangshun-zs1994.oicp.net:15202/ABE_WEB/photo/271634032221266/13101330046.png', null, '1');
COMMIT;

-- ----------------------------
-- Records of vacate
-- ----------------------------
BEGIN;
COMMIT;
